```
terraform plan
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/covidapihub/terraform-covidapihub/runs/run-WEHbTuV1Le5yBQjx

Waiting for the plan to start...

Terraform v0.12.24
Configuring remote state backend...
Initializing Terraform configuration...
2020/06/18 13:56:56 [DEBUG] Using modified User-Agent: Terraform/0.12.24 TFC/0fbfb13f32
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.github.github_branch_protection.master["terraform-covidapihub"]: Refreshing state... [id=terraform-covidapihub:master]
module.github.github_membership.administrator["chrisbsmith"]: Refreshing state... [id=covidapihub:chrisbsmith]
module.github.github_membership.administrator["kaitmore"]: Refreshing state... [id=covidapihub:kaitmore]
module.github.github_repository.repository["datasource-inshift"]: Refreshing state... [id=datasource-inshift]
module.github.github_repository.repository["terraform-covidapihub"]: Refreshing state... [id=terraform-covidapihub]
module.github.github_membership.member["dontlaugh"]: Refreshing state... [id=covidapihub:dontlaugh]
module.github.github_membership.member["hiromis"]: Refreshing state... [id=covidapihub:hiromis]
module.github.github_branch_protection.master["datasource-inshift"]: Refreshing state... [id=datasource-inshift:master]
aws_elasticache_cluster.novelcovid_redis: Refreshing state... [id=novelcovid-redis]
module.eks.aws_iam_role.master: Refreshing state... [id=eks-master-covidapihub]
module.eks.aws_iam_role.worker: Refreshing state... [id=eks-worker-covidapihub]
module.eks.aws_vpc.cluster: Refreshing state... [id=vpc-0f50416e9b4e0810e]
module.eks.aws_iam_role_policy_attachment.service: Refreshing state... [id=eks-master-covidapihub-20200407141633373900000003]
module.eks.aws_iam_role_policy_attachment.cluster: Refreshing state... [id=eks-master-covidapihub-20200407141633380800000004]
module.eks.aws_iam_role_policy_attachment.registry: Refreshing state... [id=eks-worker-covidapihub-20200407141633407200000005]
module.eks.aws_iam_role_policy_attachment.worker: Refreshing state... [id=eks-worker-covidapihub-20200407141633362900000002]
module.eks.aws_iam_role_policy_attachment.cni: Refreshing state... [id=eks-worker-covidapihub-20200407141633361200000001]
module.eks.aws_subnet.master[2]: Refreshing state... [id=subnet-08cd9b1deb18e56c2]
module.eks.aws_subnet.worker[0]: Refreshing state... [id=subnet-042777fc720e26c1e]
module.eks.aws_subnet.worker[1]: Refreshing state... [id=subnet-0dd519acb8dcf5ed2]
module.eks.aws_internet_gateway.egress: Refreshing state... [id=igw-02cb5b17938c6df72]
module.eks.aws_subnet.worker[2]: Refreshing state... [id=subnet-020841a78b640e827]
module.eks.aws_subnet.master[0]: Refreshing state... [id=subnet-00c121398d3420605]
module.eks.aws_route_table.egress: Refreshing state... [id=rtb-01dcc567b94cce0c1]
module.eks.aws_subnet.master[1]: Refreshing state... [id=subnet-0982cd3d6b04a6352]
module.eks.aws_route.egress: Refreshing state... [id=r-rtb-01dcc567b94cce0c11080289494]
module.eks.aws_route_table_association.worker-egress[2]: Refreshing state... [id=rtbassoc-05d5fa4b90321919a]
module.eks.aws_route_table_association.worker-egress[0]: Refreshing state... [id=rtbassoc-075b9906b6510e137]
module.eks.aws_route_table_association.worker-egress[1]: Refreshing state... [id=rtbassoc-0f23487a5d88989c5]
module.eks.aws_network_interface.proxy-nlb-master-nic: Refreshing state... [id=eni-067b14ce09d060968]
module.eks.aws_route_table_association.master-egress[2]: Refreshing state... [id=rtbassoc-0329fee3c3503b5a1]
module.eks.aws_route_table_association.master-egress[1]: Refreshing state... [id=rtbassoc-0630fa1c3de3121d0]
module.eks.aws_route_table_association.master-egress[0]: Refreshing state... [id=rtbassoc-04b110d0bc373951f]
module.eks.aws_eks_cluster.cluster: Refreshing state... [id=covidapihub]
module.eks.aws_eks_node_group.cluster["m5-general"]: Refreshing state... [id=covidapihub:m5-general]
module.eks.aws_eip.nlb-eip-master: Refreshing state... [id=eipalloc-0519bb158d65945a2]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_elasticache_cluster.novelcovid_redis will be destroyed
  - resource "aws_elasticache_cluster" "novelcovid_redis" {
      - arn                      = "arn:aws:elasticache:us-east-1:153757265334:cluster:novelcovid-redis" -> null
      - availability_zone        = "us-east-1c" -> null
      - az_mode                  = "single-az" -> null
      - cache_nodes              = [
          - {
              - address           = "novelcovid-redis.dvd05s.0001.use1.cache.amazonaws.com"
              - availability_zone = "us-east-1c"
              - id                = "0001"
              - port              = 6379
            },
        ] -> null
      - cluster_id               = "novelcovid-redis" -> null
      - engine                   = "redis" -> null
      - engine_version           = "3.2.10" -> null
      - id                       = "novelcovid-redis" -> null
      - maintenance_window       = "thu:10:00-thu:11:00" -> null
      - node_type                = "cache.m4.large" -> null
      - num_cache_nodes          = 1 -> null
      - parameter_group_name     = "default.redis3.2" -> null
      - port                     = 6379 -> null
      - security_group_ids       = [] -> null
      - security_group_names     = [] -> null
      - snapshot_retention_limit = 0 -> null
      - snapshot_window          = "04:00-05:00" -> null
      - subnet_group_name        = "default" -> null
      - tags                     = {} -> null
    }

  # module.eks.aws_elasticache_cluster.novelcovid_redis will be created
  + resource "aws_elasticache_cluster" "novelcovid_redis" {
      + apply_immediately      = (known after apply)
      + arn                    = (known after apply)
      + availability_zone      = (known after apply)
      + az_mode                = (known after apply)
      + cache_nodes            = (known after apply)
      + cluster_address        = (known after apply)
      + cluster_id             = "novelcovid-redis"
      + configuration_endpoint = (known after apply)
      + engine                 = "redis"
      + engine_version         = "3.2.10"
      + id                     = (known after apply)
      + maintenance_window     = (known after apply)
      + node_type              = "cache.m4.large"
      + num_cache_nodes        = 1
      + parameter_group_name   = "default.redis3.2"
      + port                   = 6379
      + replication_group_id   = (known after apply)
      + security_group_ids     = (known after apply)
      + security_group_names   = (known after apply)
      + snapshot_window        = (known after apply)
      + subnet_group_name      = "subnet-00c121398d3420605"
    }

  # module.eks.aws_security_group.novelcovid_redis_sg will be created
  + resource "aws_security_group" "novelcovid_redis_sg" {
      + arn                    = (known after apply)
      + description            = "Elasticache redis to cluster"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Inbound from VPC"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "novelcovid_redis_sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "novelcovid_redis_sg"
        }
      + vpc_id                 = "vpc-0f50416e9b4e0810e"
    }

Plan: 2 to add, 0 to change, 1 to destroy.```